-- III.
Дана таблица с инвойсами
create table invoices (
  invoice_num    varchar2(100),    -- номер инвойса
  country        varchar2(100),    -- страна
  counterparty     varchar2(100),    -- контрагент
  amount         number         -- сумма инвойса (у.е.)
)

Задание.
Необходимо вывести все строки и столбцы таблицы "invoices" и добавить столбец
"top_3_flag", который будет содержать значение "Y" в случае, если контрагент
входит в Top-3 по сумме всех его инвойсов в стране среди других контрагентов.

Задание должно быть выполнено с помощью одного SQL–предложения без использования PL/SQL.
Допускается более одного варианта решения задания.

with
invoices(invoice_num, country, counterparty, amount) as (
  select 'invoice-07', 'BY', 'B1', 1000 union all
  select 'invoice-08', 'KZ', 'K1', 20 union all
  select 'invoice-09', 'KZ', 'K1', 10 union all
  select 'invoice-10', 'KZ', 'K2', 90 union all
  select 'invoice-11', 'KZ', 'K3', 40 union all
  select 'invoice-12', 'KZ', 'K4', 10 union all
  select 'invoice-13', 'KZ', 'K4', 20 union all
  select 'invoice-14', 'KZ', 'K4', 80 union all
  select 'invoice-15', 'KZ', 'K5', 30 union all
  select 'invoice-01', 'RU', 'R1', 900 union all
  select 'invoice-02', 'RU', 'R2', 300 union all
  select 'invoice-03', 'RU', 'R3', 200 union all
  select 'invoice-04', 'RU', 'R4', 500 union all
  select 'invoice-05', 'RU', 'R4', 400 union all
  select 'invoice-06', 'RU', 'R5', 600 
)
<put your code here>

-- IV.
Дана таблица "валютные курсы"
create table currency_rates (
  rate_date     date,         -- дата
  currency_from varchar2(3),  -- валюта «из»
  currency_to   varchar2(3),  -- валюта «в»
  rate          number        -- курс пересчета
);

Данные по валютным курсам есть не на каждую дату.
Если для валютной пары на какую-либо дату нет курса, то актуальным курсом считается курс за предыдущую дату.

Задание.
Вывести валютные курсы на все даты от начала года до конца года. При этом, если на дату для валютной пары отсутствует курс, то его необходимо взять последний имеющийся к текущей дате.
Пример: если имеется только курс за 1 число и за 4 число месяца, то для 2 и 3 числа месяца надо взять курс за 1 число, а для всех дат позднее 4 числа брать курс за 4 число.
Добавить поле FLAG, которое будет содержать значение 'Y' в том случае, когда в исходных данных значение курса на данную дату отсутствовало (то есть данная строка была добавлена в результате запроса).
Таким образом, запрос должен вернуть строк больше, чем имеется в примере таблицы currency_rates, т.к. в ней есть пропущенные даты.

Листинг должен содержать все колонки из currency_rates и столбец FLAG (признак того, что данная строка отсутствовала в исходных данных и была добавлена в результате запроса ('Y' или пусто))

Задание должно быть выполнено с помощью одного SQL–предложения без использования PL/SQL. 
Предоставьте запрос, который вы считаете максимально эффективным.

-- Эмуляция таблицы currency_rates
with
currency_rates(rate_date, currency_from, currency_to, rate) as (
  select date '2023-01-01', 'USD', 'RUB', 71.9778 from dual union all
  select date '2023-01-02', 'USD', 'RUB', 70.3375 from dual union all
  select date '2023-01-10', 'USD', 'RUB', 70.3002 from dual union all
  select date '2023-01-11', 'USD', 'RUB', 69.6094 from dual union all
  select date '2023-01-01', 'USD', 'EUR',  0.9391 from dual union all
  select date '2023-01-02', 'USD', 'EUR',  0.9376 from dual union all
  select date '2023-01-04', 'USD', 'EUR',  0.9361 from dual union all
  select date '2023-01-06', 'USD', 'EUR',  0.9483 from dual
)
<put your code here>

-- РЕШЕНИЕ
with
currency_rates(rate_date, currency_from, currency_to, rate) as (
  select date '2023-01-01', 'USD', 'RUB', 71.9778 union all
  select date '2023-01-02', 'USD', 'RUB', 70.3375 union all
  select date '2023-01-10', 'USD', 'RUB', 70.3002 union all
  select date '2023-01-11', 'USD', 'RUB', 69.6094 union all
  select date '2023-01-01', 'USD', 'EUR',  0.9391 union all
  select date '2023-01-02', 'USD', 'EUR',  0.9376 union all
  select date '2023-01-04', 'USD', 'EUR',  0.9361 union all
  select date '2023-01-06', 'USD', 'EUR',  0.9483 
)
,
-- календарь на год


==============================================
V. /*
Есть две дельты данных.
Сначала загрузили Дельту 1, а позже загрузили Дельту 2, в которой поменялась строка с id = 2 и добавилась строка с id = 3.
Нужно написать запрос, который вернёт актуальное состояние данных.

--1--
id    val1    val2
1    100        A
2    201        B

--2--
id    val1    val2
2    202        T
3    301        F

----------------
id    val1    val2
1    100        A
2    202        T
3    301        F
*/


with wt_1 as (
select 1 as id, 100 as val1, 'A' as val2 union
select 2 as id, 201 as val1, 'B' as val2
),
wt_2 as (
select 2 as id, 202 as val1, 'T' as val2 union
select 3 as id, 301 as val1, 'F' as val2
)
select
...
from

=================================
VI. Переведите таблицу из вида слева в вид справа
+----------+----------+-----------+
|agrmnt_sid|report_dt |ovr_rur_amt|			agrmnt_sid	date_beg	date_end	ovr_rur_amt
+----------+----------+-----------+
|AAAA      |2021-12-19|708.8000   |				AAAA    2021-12-19	2021-12-25			708.80
|AAAA      |2021-12-20|708.8000   |             AAAA    2021-12-26  2022-01-06            0.00  
|AAAA      |2021-12-21|708.8000   |             AAAA    2022-01-07  2022-01-15          817.39       
|AAAA      |2021-12-22|708.8000   |             AAAA	2022-01-16  ...	                  0.00
|AAAA      |2021-12-23|708.8000   |				BBBB    2021-01-01  ...
|AAAA      |2021-12-24|708.8000   | 
|AAAA      |2021-12-25|708.8000   | 
|AAAA      |2021-12-26|0.0000     | 
|AAAA      |2021-12-27|0.0000     | 
|AAAA      |2021-12-28|0.0000     | 
|AAAA      |2021-12-29|0.0000     | 
|AAAA      |2021-12-30|0.0000     | 
|AAAA      |2021-12-31|0.0000     |
|AAAA      |2022-01-01|0.0000     |
|AAAA      |2022-01-02|0.0000     |
|AAAA      |2022-01-03|0.0000     |
|AAAA      |2022-01-04|0.0000     |
|AAAA      |2022-01-05|0.0000     |
|AAAA      |2022-01-06|0.0000     |
|AAAA      |2022-01-07|817.3900   |
|AAAA      |2022-01-08|817.3900   |
|AAAA      |2022-01-09|817.3900   |
|AAAA      |2022-01-10|817.3900   |
|AAAA      |2022-01-11|817.3900   |
|AAAA      |2022-01-12|817.3900   |
|AAAA      |2022-01-13|817.3900   |
|AAAA      |2022-01-14|817.3900   |
|AAAA      |2022-01-15|817.3900   |
|AAAA      |2022-01-16|0.0000     |
|AAAA      |2022-01-17|0.0000     |
|AAAA      |2022-01-18|0.0000     |
|AAAA      |2022-01-19|0.0000     |
|AAAA      |2022-01-20|0.0000     |
|AAAA      |2022-01-21|0.0000     |
|AAAA      |2022-01-22|0.0000     |
|AAAA      |2022-01-23|0.0000     |
|AAAA      |2022-01-24|0.0000     |
|AAAA      |2022-01-25|0.0000     |
|AAAA      |2022-01-26|0.0000     |
|AAAA      |2022-01-27|0.0000     |
|AAAA      |2022-01-28|0.0000     |
|AAAA      |2022-01-29|0.0000     |
|AAAA      |2022-01-30|0.0000     |
|AAAA      |2022-01-31|799.6000   |
|AAAA      |2022-02-01|799.6000   |
|AAAA      |2022-02-02|799.6000   |
|AAAA      |2022-02-03|799.6000   |
|AAAA      |2022-02-04|799.6000   |
|AAAA      |2022-02-05|799.6000   |
|AAAA      |2022-02-06|799.6000   |
|AAAA      |2022-02-07|0.0000     |
|AAAA      |2022-02-08|0.0000     |
|AAAA      |2022-02-09|0.0000     |
|AAAA      |2022-02-10|0.0000     |
|AAAA      |2022-02-11|0.0000     |
|AAAA      |2022-02-12|0.0000     |
|AAAA      |2022-02-13|0.0000     |
|AAAA      |2022-02-14|0.0000     |
|AAAA      |2022-02-15|0.0000     |
|AAAA      |2022-02-16|0.0000     |
|AAAA      |2022-02-17|0.0000     |
|AAAA      |2022-02-18|0.0000     |
|AAAA      |2022-02-19|0.0000     |
|AAAA      |2022-02-20|0.0000     |
|AAAA      |2022-02-21|0.0000     |
|AAAA      |2022-02-22|0.0000     |
|AAAA      |2022-02-23|0.0000     |
|AAAA      |2022-02-24|0.0000     |
|AAAA      |2022-02-25|0.0000     |
|AAAA      |2022-02-26|0.0000     |
|AAAA      |2022-02-27|0.0000     |
|AAAA      |2022-02-28|776.8300   |
|AAAA      |2022-03-01|776.8300   |
|AAAA      |2022-03-02|776.8300   |
|AAAA      |2022-03-03|776.8300   |
|AAAA      |2022-03-04|776.8300   |
|AAAA      |2022-03-05|776.8300   |
|AAAA      |2022-03-06|776.8300   |
|AAAA      |2022-03-07|776.8300   |
|AAAA      |2022-03-08|776.8300   |
|AAAA      |2022-03-09|776.8300   |
|AAAA      |2022-03-10|776.8300   |
|AAAA      |2022-03-11|776.8300   |
|AAAA      |2022-03-12|776.8300   |
|AAAA      |2022-03-13|776.8300   |
|AAAA      |2022-03-14|776.8300   |
|AAAA      |2022-03-15|776.8300   |
|AAAA      |2022-03-16|0.0000     |
|AAAA      |2022-03-17|0.0000     |
|AAAA      |2022-03-18|0.0000     |
|AAAA      |2022-03-19|0.0000     |
|AAAA      |2022-03-20|0.0000     |
|AAAA      |2022-03-21|0.0000     |
|AAAA      |2022-03-22|0.0000     |
|AAAA      |2022-03-23|0.0000     |
|AAAA      |2022-03-24|0.0000     |
|AAAA      |2022-03-25|0.0000     |
|AAAA      |2022-03-26|0.0000     |
|AAAA      |2022-03-27|0.0000     |
|AAAA      |2022-03-28|0.0000     |
|AAAA      |2022-03-29|0.0000     |
|AAAA      |2022-03-30|0.0000     |
|AAAA      |2022-03-31|740.9000   |
+----------+----------+-----------+


